# Table of Contents
 <p><div class="lev1 toc-item"><a href="#Prepare-a-dataframe" data-toc-modified-id="Prepare-a-dataframe-1"><span class="toc-item-num">1&nbsp;&nbsp;</span>Prepare a dataframe</a></div><div class="lev2 toc-item"><a href="#Select-row-3-7" data-toc-modified-id="Select-row-3-7-11"><span class="toc-item-num">1.1&nbsp;&nbsp;</span>Select row 3-7</a></div><div class="lev2 toc-item"><a href="#Select-column" data-toc-modified-id="Select-column-12"><span class="toc-item-num">1.2&nbsp;&nbsp;</span>Select column</a></div><div class="lev2 toc-item"><a href="#Replace-df.loc[0][3]-with-missing" data-toc-modified-id="Replace-df.loc[0][3]-with-missing-13"><span class="toc-item-num">1.3&nbsp;&nbsp;</span>Replace df.loc[0][3] with missing</a></div><div class="lev2 toc-item"><a href="#drop-na-by-row-and-dont-overwrite" data-toc-modified-id="drop-na-by-row-and-dont-overwrite-14"><span class="toc-item-num">1.4&nbsp;&nbsp;</span>drop na by row and dont overwrite</a></div><div class="lev2 toc-item"><a href="#Add-ID-number-to-our-samples" data-toc-modified-id="Add-ID-number-to-our-samples-15"><span class="toc-item-num">1.5&nbsp;&nbsp;</span>Add ID number to our samples</a></div><div class="lev2 toc-item"><a href="#Make-a-deep-copy-of-df1" data-toc-modified-id="Make-a-deep-copy-of-df1-16"><span class="toc-item-num">1.6&nbsp;&nbsp;</span>Make a deep copy of df1</a></div><div class="lev2 toc-item"><a href="#Keep-[0,10]-for-df1-and-[5,-15]-for-df2" data-toc-modified-id="Keep-[0,10]-for-df1-and-[5,-15]-for-df2-17"><span class="toc-item-num">1.7&nbsp;&nbsp;</span>Keep [0,10] for df1 and [5, 15] for df2</a></div><div class="lev2 toc-item"><a href="#Merge-two-dfs-with-pd.merge,-rename-suffix" data-toc-modified-id="Merge-two-dfs-with-pd.merge,-rename-suffix-18"><span class="toc-item-num">1.8&nbsp;&nbsp;</span>Merge two dfs with pd.merge, rename suffix</a></div><div class="lev2 toc-item"><a href="#Use-np.where-to-get-the-absolute-value-of-df1,-add-it-to-df1" data-toc-modified-id="Use-np.where-to-get-the-absolute-value-of-df1,-add-it-to-df1-19"><span class="toc-item-num">1.9&nbsp;&nbsp;</span>Use np.where to get the absolute value of df1, add it to df1</a></div><div class="lev2 toc-item"><a href="#Sampling-a-categoric-data-to-df,-range(0,3)" data-toc-modified-id="Sampling-a-categoric-data-to-df,-range(0,3)-110"><span class="toc-item-num">1.10&nbsp;&nbsp;</span>Sampling a categoric data to df, range(0,3)</a></div><div class="lev2 toc-item"><a href="#groupby-type-and-get-mean-of-X0" data-toc-modified-id="groupby-type-and-get-mean-of-X0-111"><span class="toc-item-num">1.11&nbsp;&nbsp;</span>groupby type and get mean of X0</a></div><div class="lev2 toc-item"><a href="#add-date-to-df,-starting-at-2022-Feb-8" data-toc-modified-id="add-date-to-df,-starting-at-2022-Feb-8-112"><span class="toc-item-num">1.12&nbsp;&nbsp;</span>add date to df, starting at 2022-Feb-8</a></div><div class="lev2 toc-item"><a href="#concat-firs-three-rows-of-df-to-df" data-toc-modified-id="concat-firs-three-rows-of-df-to-df-113"><span class="toc-item-num">1.13&nbsp;&nbsp;</span>concat firs three rows of df to df</a></div><div class="lev2 toc-item"><a href="#find-duplicates" data-toc-modified-id="find-duplicates-114"><span class="toc-item-num">1.14&nbsp;&nbsp;</span>find duplicates</a></div><div class="lev2 toc-item"><a href="#drop-duplicates,-keep-none,-keep-first,-keep-last" data-toc-modified-id="drop-duplicates,-keep-none,-keep-first,-keep-last-115"><span class="toc-item-num">1.15&nbsp;&nbsp;</span>drop duplicates, keep none, keep first, keep last</a></div><div class="lev2 toc-item"><a href="#find-the-diff-between-df-and-df_duplicated" data-toc-modified-id="find-the-diff-between-df-and-df_duplicated-116"><span class="toc-item-num">1.16&nbsp;&nbsp;</span>find the diff between df and df_duplicated</a></div><div class="lev2 toc-item"><a href="#loop-row-by-row-using-apply" data-toc-modified-id="loop-row-by-row-using-apply-117"><span class="toc-item-num">1.17&nbsp;&nbsp;</span>loop row by row using apply</a></div><div class="lev2 toc-item"><a href="#Output-df-to-csv" data-toc-modified-id="Output-df-to-csv-118"><span class="toc-item-num">1.18&nbsp;&nbsp;</span>Output df to csv</a></div><div class="lev2 toc-item"><a href="#read-by-chunk" data-toc-modified-id="read-by-chunk-119"><span class="toc-item-num">1.19&nbsp;&nbsp;</span>read by chunk</a></div>

In [3]:
import pandas as pd
import numpy as np
import statsmodels.api as sm

# Prepare a dataframe

In [4]:
mu, sigma = 0, 1
N = 100
X = np.random.normal(mu, sigma, size=(N,2))
intercept = 1
error = np.random.normal(mu, 0.1*sigma, size=(N))
Y = X[:, 0]*2 + X[:,1]*3 + error + intercept
X = sm.add_constant(X)
data = pd.DataFrame({"X0":X[:, 0], "X1":X[:, 1], "X2":X[:, 2], "Y":Y})

In [6]:
data.head()

    X0        X1        X2         Y
0  1.0 -0.567464 -0.931079 -2.979348
1  1.0  1.717240 -1.639516 -0.432638
2  1.0 -0.785125  0.320842  0.400118
3  1.0 -0.707802 -0.174688 -0.900658
4  1.0 -1.391498 -0.021108 -1.789778

## Select row 3-7

In [7]:
df = data

print(df.iloc[0:3, :])

    X0        X1        X2         Y
0  1.0 -0.567464 -0.931079 -2.979348
1  1.0  1.717240 -1.639516 -0.432638
2  1.0 -0.785125  0.320842  0.400118

## Select column

In [12]:
# select multiple columns by names
ans1 = df[['X2', 'Y']]

ans2 = df.iloc[:,2:]

In [13]:
print(ans1.head())

         X2         Y
0 -0.931079 -2.979348
1 -1.639516 -0.432638
2  0.320842  0.400118
3 -0.174688 -0.900658
4 -0.021108 -1.789778

In [14]:
print(ans2.head())

         X2         Y
0 -0.931079 -2.979348
1 -1.639516 -0.432638
2  0.320842  0.400118
3 -0.174688 -0.900658
4 -0.021108 -1.789778

## Replace df.loc[0][3] with missing

In [15]:
df.head()

    X0        X1        X2         Y
0  1.0 -0.567464 -0.931079 -2.979348
1  1.0  1.717240 -1.639516 -0.432638
2  1.0 -0.785125  0.320842  0.400118
3  1.0 -0.707802 -0.174688 -0.900658
4  1.0 -1.391498 -0.021108 -1.789778

In [17]:
df.iloc[0,3]

-2.9793476244032555

In [18]:
df.iloc[0,3] = np.nan

In [19]:
df.head(1)

    X0        X1        X2   Y
0  1.0 -0.567464 -0.931079 NaN

## drop na by row and dont overwrite

In [23]:
print(df.shape)
# here, axis=0 will be changed
print(df.dropna(axis=0).shape)

# here axis=1 will be changed, and axis=0 is the same
print(df.dropna(axis=1).shape)

(100, 4)
(99, 4)
(100, 3)

## Add ID number to our samples

In [26]:
df1 = df.reset_index().rename(columns={"index":"Sample ID"})

## Make a deep copy of df1

In [36]:
df2 = df1.copy(deep=True) # default is also true

print(id(df2['X1']))
print(id(df1['X1']))

140550395517632
140550395516672

In [39]:
df2 = df1.copy(deep=False) # make it false here

print(id(df2))
print(id(df1))

140550395517584
140550395434080

## Keep [0,10] for df1 and [5, 15] for df2

In [40]:
df1 = df1.iloc[0:10,:]
print(df1.shape)

df2 = df2.iloc[5:15, :]
print(df2.shape)

(10, 5)
(10, 5)

## Merge two dfs with pd.merge, rename suffix

In [43]:
merged = pd.merge(df1, df2, how='inner', on='Sample ID', suffixes=("_df1", "_df2"))

In [44]:
merged

,Sample ID,X0_df1,X1_df1,X2_df1,Y_df1,X0_df2,X1_df2,X2_df2,Y_df2
0,5,1.0,1.365948,0.413803,4.920567,1.0,1.365948,0.413803,4.920567
1,6,1.0,0.358125,-0.533465,-0.001091,1.0,0.358125,-0.533465,-0.001091
2,7,1.0,0.600601,0.146732,2.624350,1.0,0.600601,0.146732,2.624350
3,8,1.0,-0.042533,-1.755382,-4.410504,1.0,-0.042533,-1.755382,-4.410504
4,9,1.0,0.247390,1.205187,5.090265,1.0,0.247390,1.205187,5.090265

## Use np.where to get the absolute value of df1, add it to df1

In [45]:
df1.head()

   Sample ID   X0        X1        X2         Y
0          0  1.0 -0.567464 -0.931079       NaN
1          1  1.0  1.717240 -1.639516 -0.432638
2          2  1.0 -0.785125  0.320842  0.400118
3          3  1.0 -0.707802 -0.174688 -0.900658
4          4  1.0 -1.391498 -0.021108 -1.789778

In [47]:
mask = df1['X1'] > 0
df1['|X1|'] = np.where(mask, df1['X1'], -df1['X1'])

In [48]:
df1

   Sample ID   X0        X1        X2         Y      |X1|
0          0  1.0 -0.567464 -0.931079       NaN  0.567464
1          1  1.0  1.717240 -1.639516 -0.432638  1.717240
2          2  1.0 -0.785125  0.320842  0.400118  0.785125
3          3  1.0 -0.707802 -0.174688 -0.900658  0.707802
4          4  1.0 -1.391498 -0.021108 -1.789778  1.391498
5          5  1.0  1.365948  0.413803  4.920567  1.365948
6          6  1.0  0.358125 -0.533465 -0.001091  0.358125
7          7  1.0  0.600601  0.146732  2.624350  0.600601
8          8  1.0 -0.042533 -1.755382 -4.410504  0.042533
9          9  1.0  0.247390  1.205187  5.090265  0.247390

## Sampling a categoric data to df, range(0,3)

In [58]:
df['type'] = np.random.randint(0,3, size=(df.shape[0],))

In [60]:
df.head()

    X0        X1        X2         Y  type
0  1.0 -0.567464 -0.931079       NaN     0
1  1.0  1.717240 -1.639516 -0.432638     2
2  1.0 -0.785125  0.320842  0.400118     2
3  1.0 -0.707802 -0.174688 -0.900658     0
4  1.0 -1.391498 -0.021108 -1.789778     0

## groupby type and get mean of X0

In [61]:

df.groupby('type').apply(lambda x: x.mean())

       X0        X1        X2         Y  type
type
0     1.0 -0.300702 -0.080749  0.297835   0.0
1     1.0 -0.051006 -0.170129  0.387253   1.0
2     1.0 -0.091504 -0.025254  0.722630   2.0

## add date to df, starting at 2022-Feb-8

In [66]:
df['Date'] = pd.date_range('2022-2-8', periods=100)

In [68]:
df.dtypes

X0             float64
X1             float64
X2             float64
Y              float64
type             int64
Date    datetime64[ns]
dtype: object

In [69]:
df.head()

    X0        X1        X2         Y  type       Date
0  1.0 -0.567464 -0.931079       NaN     0 2022-02-08
1  1.0  1.717240 -1.639516 -0.432638     2 2022-02-09
2  1.0 -0.785125  0.320842  0.400118     2 2022-02-10
3  1.0 -0.707802 -0.174688 -0.900658     0 2022-02-11
4  1.0 -1.391498 -0.021108 -1.789778     0 2022-02-12

## concat firs three rows of df to df

In [70]:
df_small = df.iloc[0:3,:]

In [74]:
df_duplicated = pd.concat([df, df_small], axis=0)

In [75]:
df_duplicated.shape

(103, 6)

In [77]:
df_duplicated.tail()

     X0        X1        X2         Y  type       Date
98  1.0 -0.248327  0.099522  0.904248     2 2022-05-17
99  1.0  0.697865  1.479909  6.822559     2 2022-05-18
0   1.0 -0.567464 -0.931079       NaN     0 2022-02-08
1   1.0  1.717240 -1.639516 -0.432638     2 2022-02-09
2   1.0 -0.785125  0.320842  0.400118     2 2022-02-10

## find duplicates

In [78]:
df_duplicated.duplicated()

0     False
1     False
2     False
3     False
4     False
      ...
98    False
99    False
0      True
1      True
2      True
Length: 103, dtype: bool

## drop duplicates, keep none, keep first, keep last

In [81]:
print(df_duplicated.shape)
print(df_duplicated.drop_duplicates(keep=False).shape)

(103, 6)
(97, 6)

In [83]:
df_duplicated.drop_duplicates(keep='last')

     X0        X1        X2         Y  type       Date
3   1.0 -0.707802 -0.174688 -0.900658     0 2022-02-11
4   1.0 -1.391498 -0.021108 -1.789778     0 2022-02-12
5   1.0  1.365948  0.413803  4.920567     0 2022-02-13
6   1.0  0.358125 -0.533465 -0.001091     0 2022-02-14
7   1.0  0.600601  0.146732  2.624350     1 2022-02-15
..  ...       ...       ...       ...   ...        ...
98  1.0 -0.248327  0.099522  0.904248     2 2022-05-17
99  1.0  0.697865  1.479909  6.822559     2 2022-05-18
0   1.0 -0.567464 -0.931079       NaN     0 2022-02-08
1   1.0  1.717240 -1.639516 -0.432638     2 2022-02-09
2   1.0 -0.785125  0.320842  0.400118     2 2022-02-10

[100 rows x 6 columns]

## find the diff between df and df_duplicated

In [84]:
df_without_first_three = df_duplicated.drop_duplicates(keep=False)

In [86]:
diff = pd.concat([df, df_without_first_three]).drop_duplicates(keep=False)

In [87]:
diff

    X0        X1        X2         Y  type       Date
0  1.0 -0.567464 -0.931079       NaN     0 2022-02-08
1  1.0  1.717240 -1.639516 -0.432638     2 2022-02-09
2  1.0 -0.785125  0.320842  0.400118     2 2022-02-10

## loop row by row using apply

In [102]:
def f(x):
    for i in x:
        print(i)
diff.apply(f, axis=1)

1.0
-0.5674644434151771
-0.9310786426580836
nan
0
2022-02-08 00:00:00
1.0
1.71724010306611
-1.6395155529284826
-0.43263845198314543
2
2022-02-09 00:00:00
1.0
-0.7851247268944032
0.3208416960978822
0.4001177755126495
2
2022-02-10 00:00:00

0    None
1    None
2    None
dtype: object

## Output df to csv

In [103]:
df.to_csv("lr.csv")

## read by chunk

In [110]:
chunks = pd.read_csv('lr.csv', chunksize=20)

In [111]:
for i in chunks:
    print(i)
    break

    Unnamed: 0   X0        X1        X2         Y  type        Date
0            0  1.0 -0.567464 -0.931079       NaN     0  2022-02-08
1            1  1.0  1.717240 -1.639516 -0.432638     2  2022-02-09
2            2  1.0 -0.785125  0.320842  0.400118     2  2022-02-10
3            3  1.0 -0.707802 -0.174688 -0.900658     0  2022-02-11
4            4  1.0 -1.391498 -0.021108 -1.789778     0  2022-02-12
5            5  1.0  1.365948  0.413803  4.920567     0  2022-02-13
6            6  1.0  0.358125 -0.533465 -0.001091     0  2022-02-14
7            7  1.0  0.600601  0.146732  2.624350     1  2022-02-15
8            8  1.0 -0.042533 -1.755382 -4.410504     2  2022-02-16
9            9  1.0  0.247390  1.205187  5.090265     1  2022-02-17
10          10  1.0 -0.804117  0.015119 -0.407113     1  2022-02-18
11          11  1.0  0.548388 -0.120124  1.840511     0  2022-02-19
12          12  1.0 -1.586830 -0.895314 -4.738616     0  2022-02-20
13          13  1.0 -0.238916  0.695767  2.717445     0  2022-02-21
14          14  1.0 -0.887277  0.820611  1.622594     1  2022-02-22
15          15  1.0  0.519887 -0.324473  1.028903     1  2022-02-23
16          16  1.0 -0.857337 -0.132735 -1.008156     0  2022-02-24
17          17  1.0  0.103101  1.978350  7.194863     1  2022-02-25
18          18  1.0  0.333188 -0.195889  0.900397     2  2022-02-26
19          19  1.0  0.640315  0.256677  2.980159     1  2022-02-27